hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
/**
 * @file ax25.c
 *
 * @author Emiliano Augusto Gonzalez ( lu3vea @ gmail . com)
 * @date 2026
 * @copyright GNU General Public License v3
 * @see https://github.com/hiperiondev/esp32idf_APRS
 *
 * @note
 * This is based on other projects:
 *     VP-Digi: https://github.com/sq8vps/vp-digi
 *     ESP32APRS: https://github.com/nakhonthai/ESP32APRS_Audio
 *     LibAPRS: https://github.com/markqvist/LibAPRS
 *
 *     please contact their authors for more information.
 *
 * @brief AX.25 frame handling implementation: HDLC bit-level receive and
 * transmit state machines, bit stuffing, FCS checking, frame buffering and the
 * CSMA/p-persistence channel access logic.
 */

#include <stdbool.h>
#include <stdlib.h>
#include <string.h>

#include "esp_attr.h"
#include "esp_log.h"
#include "esp_random.h"
#include "esp_timer.h"

#include "ax25.h"
#include "crc_ccit.h"
#include "esp32idf_radioamateur_modem.h" /* modem_format_tnc2() for the readable TX log line */
#include "modem.h"

#ifdef ENABLE_FX25
#include "fx25.h"
#endif

static const char *TAG = "ax25";

struct Ax25ProtoConfig Ax25Config;

/*
 * One slot is deliberately left unused in each handle ring so that
 * head == tail unambiguously means "empty" and head + 1 == tail means "full".
 * That removes the shared rxFrameBufferFull/txFrameBufferFull flags, which
 * were read-modify-written from two different cores with no synchronisation.
 * Hence one more than the usable depth.
 *
 * 8 slots (7 usable) rather than the original 4 (3 usable): during
 * digipeating/igating, several RF frames can arrive back-to-back and each
 * gets re-queued for TX while the AFSK modem is still keying up and sending
 * the previous one (hundreds of ms at 1200 baud). With only 3 usable slots
 * that burst routinely overran the ring and later frames in the burst were
 * silently dropped ("TX buffer full, frame dropped"). The extra headroom
 * costs 4 * AX25_FRAME_MAX_SIZE (~1.3KB) more on each of the tx/rx byte
 * buffers, which is negligible on ESP32.
 */
#define FRAME_MAX_COUNT   (8) /* ring slots; usable depth is FRAME_MAX_COUNT-1 */
#define FRAME_BUFFER_SIZE (FRAME_MAX_COUNT * AX25_FRAME_MAX_SIZE)

#define RING_NEXT(i) (((i) + 1u) % FRAME_MAX_COUNT)

/*
 * How long a just-accepted frame's CRC is remembered so that the second
 * demodulator's copy of the SAME frame is recognised as a duplicate and
 * dropped.
 *
 * This used to be 4 * MODEM_MAX_DEMODULATOR_COUNT, which reads like "4 per
 * demodulator" but is not: the counter is bumped once per Ax25BitParse() call
 * and there is one call per demodulator per bit, so the window was 4 BIT
 * PERIODS. The group delay between the two demodulators' filters is larger
 * than that, so the slower one routinely found lastCrc already cleared and
 * stored the frame a second time (this is what makes decoded > sent in the
 * loopback self test).
 *
 * The window has to exceed the worst-case inter-demodulator skew and stay
 * below the shortest interval at which a station could legitimately repeat a
 * byte-identical frame. 32 bit periods is ~27 ms at 1200 Bd and ~107 ms at
 * 300 Bd; both sit comfortably in that gap.
 */
#define RX_DEDUP_HOLD_BITS  32
#define RX_DEDUP_HOLD_CALLS (RX_DEDUP_HOLD_BITS * MODEM_MAX_DEMODULATOR_COUNT)

#define STATIC_HEADER_FLAG_COUNT 4 /* flags sent before each frame */
#define STATIC_FOOTER_FLAG_COUNT 1 /* flags sent after each frame */

#define MAX_TRANSMIT_RETRY_COUNT 8 /* max retries if the channel is busy */

#define SYNC_BYTE 0x7E /* preamble/postamble octet */

static inline uint32_t millis(void) {
    return (uint32_t)(esp_timer_get_time() / 1000);
}

static inline uint32_t randomRange(uint32_t lo, uint32_t hi) {
    return lo + (esp_random() % (hi - lo));
}

struct FrameHandle {
    uint16_t start;
    uint16_t size;
    int8_t peak;
    int8_t valley;
    uint8_t level;
    uint8_t corrected;
    uint16_t mVrms;
#ifdef ENABLE_FX25
    struct Fx25Mode *fx25Mode;
#endif
};

/*
 * The RX rings are single-producer / single-consumer, and the two ends live on
 * DIFFERENT CORES:
 *
 *   producer: Ax25BitParse()        <- afsk_rx_task, pinned to MODEM_RX_TASK_CORE
 *   consumer: Ax25ReadNextRxFrame() <- modem_service_task
 *
 * CONFIG_FREERTOS_UNICORE is not set, so those two genuinely run in parallel.
 * Every index below is therefore owned by exactly one side and published to
 * the other with an explicit release/acquire pair; nothing is read-modify-
 * written by both. Plain loads and stores of these would be reordered both by
 * the compiler and by the store buffer, which is what let the consumer observe
 * a frame handle whose payload had not been written yet.
 */
static uint8_t rxBuffer[FRAME_BUFFER_SIZE];
static uint16_t rxBufferHead = 0; /* producer owns; published to consumer */
static uint16_t rxBufferTail = 0; /* consumer owns; published to producer */
static struct FrameHandle rxFrame[FRAME_MAX_COUNT];
static uint8_t rxFrameHead = 0; /* producer owns; published to consumer */
static uint8_t rxFrameTail = 0; /* consumer owns; published to producer */

/*
 * TX is the mirror image: Ax25WriteTxFrame() runs in the caller's task while
 * Ax25GetTxBit() runs in the DAC sample-clock ISR on another core.
 */
static uint8_t txBuffer[FRAME_BUFFER_SIZE];
static uint16_t txBufferHead = 0;
static uint16_t txBufferTail = 0;
static struct FrameHandle txFrame[FRAME_MAX_COUNT];
static uint8_t txFrameHead = 0; /* producer owns; published to the DAC ISR */
static uint8_t txFrameTail = 0; /* DAC ISR owns; published to the producer */

/* Publish everything written before this point, then make `idx` visible. */
#define RING_PUBLISH(var, idx) __atomic_store_n(&(var), (idx), __ATOMIC_RELEASE)
/* Read an index published by the other side, then see everything it wrote. */
#define RING_OBSERVE(var) __atomic_load_n(&(var), __ATOMIC_ACQUIRE)

/**
 * @brief Bytes free in a frame byte-buffer, keeping one spare so that
 *        head == tail always means empty and never "completely full".
 */
static inline uint16_t ringByteSpace(uint16_t head, uint16_t tail) {
    uint16_t used = (head >= tail) ? (uint16_t)(head - tail) : (uint16_t)(FRAME_BUFFER_SIZE - tail + head);
    return (uint16_t)(FRAME_BUFFER_SIZE - used - 1u);
}

/**
 * @brief Producer-side check: is there room for one more RX frame of @p size
 *        bytes, both in the handle ring and in the byte buffer?
 *
 * The byte-buffer half of this did not exist before: rxBufferHead simply wrapped
 * modulo FRAME_BUFFER_SIZE and silently overwrote frames the service task had
 * not read yet. Only txBuffer was ever checked (GET_FREE_SIZE, in
 * Ax25WriteTxFrame).
 */
static bool rxRingHasRoom(uint16_t size) {
    if (RING_NEXT(rxFrameHead) == RING_OBSERVE(rxFrameTail))
        return false;
    return ringByteSpace(rxBufferHead, RING_OBSERVE(rxBufferTail)) >= size;
}

#ifdef ENABLE_FX25
static uint8_t txFx25Buffer[FX25_MAX_BLOCK_SIZE];
static uint8_t txTagByteIdx = 0;
#endif

enum TxStage {
    TX_STAGE_IDLE = 0,
    TX_STAGE_PREAMBLE,
    TX_STAGE_HEADER_FLAGS,
    TX_STAGE_DATA,
    TX_STAGE_CRC,
    TX_STAGE_FOOTER_FLAGS,
    TX_STAGE_TAIL,
#ifdef ENABLE_FX25
    TX_STAGE_CORRELATION_TAG,
#endif
};

