hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
enum TxInitStage {
    TX_INIT_OFF,
    TX_INIT_WAITING,
    TX_INIT_TRANSMITTING,
};

static uint8_t txByte = 0;
static uint16_t txByteIdx = 0;
static int8_t txBitIdx = 0;
static uint16_t txDelayElapsed = 0;
static uint8_t txFlagsElapsed = 0;
static uint8_t txCrcByteIdx = 0;
static uint8_t txBitstuff = 0;
static uint16_t txTailElapsed;
static uint16_t txCrc = 0xFFFF;
static uint32_t txQuiet = 0;
static uint8_t txRetries = 0;
static volatile enum TxInitStage txInitStage;
static enum TxStage txStage;

/*
 * Ax25GetTxBit() runs in the DAC sample-clock ISR (IRAM_ATTR), so it cannot
 * call ESP_LOGx directly - logging from an ISR risks blowing the ISR's stack
 * and stalling the very timer that clocks the waveform out. Instead the ISR
 * only sets these flags/counters (plain stores, single writer), and
 * Ax25TransmitCheck() - which already runs once per service-task tick in
 * normal task context - polls them and does the actual logging.
 */
static volatile uint32_t txFramesSentCount = 0; /* bumped once per frame fully clocked out */
static volatile bool txJustKeyedUp = false;      /* set true when PTT/DAC is (re)started */
static volatile bool txJustKeyedDown = false;    /* set true when TX tail finishes and PTT drops */

struct RxState {
    uint16_t crc;
    uint8_t frame[AX25_FRAME_MAX_SIZE];
    uint16_t frameIdx;
    uint8_t receivedByte;
    uint8_t receivedBitIdx;
    uint8_t rawData;
    enum Ax25RxStage rx;
#ifdef ENABLE_FX25
    struct Fx25Mode *fx25Mode;
    uint64_t tag;
#endif
};

static struct RxState rxState[MODEM_MAX_DEMODULATOR_COUNT];

static uint16_t lastCrc = 0;          /* CRC of the last received frame */
static uint16_t rxMultiplexDelay = 0; /* avoids receiving the same frame twice */

static uint16_t txDelay;
static uint16_t txTail;

static uint8_t outputFrameBuffer[AX25_FRAME_MAX_SIZE];

/* Scratch buffer used only to linearize the about-to-transmit frame (which
 * lives in the circular txBuffer) so it can be handed to ax25_decode() for
 * the "PTT ON" log line. Separate from outputFrameBuffer since that one is
 * used for RX frames and could otherwise be clobbered if both paths were
 * ever serviced close together. */
static uint8_t txLogBuffer[AX25_FRAME_MAX_SIZE];

/**
 * @brief Recalculate the CRC for one bit
 */
/* Called once per transmitted bit from Ax25GetTxBit(), which is IRAM_ATTR.
 * -O2 will almost certainly inline it, but "almost certainly" is not a
 * guarantee, and if it does not, every bit of every frame becomes a potential
 * flash fetch from inside the sample ISR. Pin it. */
static void IRAM_ATTR calculateCRC(uint8_t bit, uint16_t *crc) {
    uint16_t xor_result = *crc ^ bit;
    *crc >>= 1;
    if (xor_result & 0x0001)
        *crc ^= 0x8408;
}

#define countof(a) (sizeof(a) / sizeof(a[0]))

#define DECODE_CALL(buf, addr)                                                                                                                                 \
    for (unsigned i = 0; i < sizeof((addr)) - CALL_OVERSPACE; i++) {                                                                                           \
        char c = (char)(*(buf)++ >> 1);                                                                                                                        \
        (addr)[i] = (c == ' ') ? '\x0' : c;                                                                                                                    \
    }

#define AX25_SET_REPEATED(msg, idx, val)                                                                                                                       \
    do {                                                                                                                                                       \
        if (val)                                                                                                                                               \
            (msg)->rpt_flags |= (1u << (idx));                                                                                                                 \
        else                                                                                                                                                   \
            (msg)->rpt_flags &= ~(1u << (idx));                                                                                                                \
    } while (0)

bool ax25_decode(uint8_t *buf, size_t len, uint16_t mVrms, ax25_msg_t *msg) {
    uint8_t *buf_start = buf;

    DECODE_CALL(buf, msg->dst.call);
    msg->dst.ssid = (*buf++ >> 1) & 0x0F;
    msg->dst.call[6] = 0;

    DECODE_CALL(buf, msg->src.call);
    msg->src.ssid = (*buf >> 1) & 0x0F;
    msg->src.call[6] = 0;

    for (msg->rpt_count = 0; !(*buf++ & 0x01) && (msg->rpt_count < countof(msg->rpt_list)); msg->rpt_count++) {
        DECODE_CALL(buf, msg->rpt_list[msg->rpt_count].call);
        msg->rpt_list[msg->rpt_count].ssid = (*buf >> 1) & 0x0F;
        AX25_SET_REPEATED(msg, msg->rpt_count, (*buf & 0x80));
        msg->rpt_list[msg->rpt_count].call[6] = 0;
    }

    msg->ctrl = *buf++;
    if (msg->ctrl != AX25_CTRL_UI)
        return false; // not a UI frame (corrupted, or legitimate non-APRS AX.25 traffic)

    msg->pid = *buf++;
    if (msg->pid != AX25_PID_NOLAYER3)
        return false; // UI frame but not "no layer 3" - not an APRS frame

    memset(msg->info, 0, sizeof(msg->info));
    int rest = (int)((buf_start + len) - buf);
    if (rest > 0) {
        if (rest > (int)sizeof(msg->info) - 1)
            rest = (int)sizeof(msg->info) - 1;
        msg->len = (size_t)rest;
        /* memcpy, not strncpy: the info field may legally contain any byte */
        memcpy(msg->info, buf, (size_t)rest);
    } else {
        msg->len = 0;
    }
    msg->mVrms = mVrms;
    return true;
}

#ifdef ENABLE_FX25
/**
 * @brief Roll rxBufferHead back after a failed FX.25 parse.
 *
 * Takes the start position as an argument rather than reading it back out of
 * rxFrame[rxFrameHead].start. The handle for a frame in progress is no longer
 * written until the frame has been validated, so there is nothing to read back;
 * relying on it also meant the rollback silently depended on rxFrameHead not
 * having moved.
 */
static void removeLastFrameFromRxBuffer(uint16_t start) {
    rxBufferHead = start;
}

