hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
    if (ringByteSpace(txBufferHead, RING_OBSERVE(txBufferTail)) < size) {
        ESP_LOGW(TAG, "TX buffer full, frame dropped (%u bytes, %u available)",
                 size, ringByteSpace(txBufferHead, RING_OBSERVE(txBufferTail)));
        return NULL;
    }

    ESP_LOGI(TAG, "TX frame queued: %u bytes", size);

    /* Decode the frame we just queued back into a readable TNC2 line
     * ("SRC>DST,PATH:info") for the serial log. ax25_decode() only reads the
     * buffer (so the const cast is safe) and returns false for non-UI/non-APRS
     * frames, which we simply don't print. This runs in the caller's task
     * (beacon / message / service tick / weather), all of which have generous
     * stacks, and is skipped entirely when INFO logging is off for this tag so
     * it costs nothing in that case. */
    if (esp_log_level_get(TAG) >= ESP_LOG_INFO) {
        ax25_msg_t decoded;
        if (ax25_decode((uint8_t *)data, size, 0, &decoded)) {
            char tnc2[256];
            modem_format_tnc2(&decoded, tnc2, sizeof(tnc2));
            ESP_LOGI(TAG, "TX frame: %s", tnc2);
        }
    }

    txFrame[txFrameHead].size = size;
    txFrame[txFrameHead].start = txBufferHead;

#ifdef ENABLE_FX25
    txFrame[txFrameHead].fx25Mode = NULL;
#endif

    for (uint16_t i = 0; i < size; i++) {
        txBuffer[txBufferHead++] = data[i];
        txBufferHead %= FRAME_BUFFER_SIZE;
    }

    void *ret = &txFrame[txFrameHead];
    RING_PUBLISH(txFrameHead, RING_NEXT(txFrameHead)); /* payload is in place */
    return ret;
}

uint8_t Ax25TxFramesPending(void) {
    /* Producer-side read of the same ring Ax25WriteTxFrame() checks: the tail
     * is only advanced by the DAC ISR's txRetireFrame(), once a queued
     * frame's transmission (including any quiet-time wait before it started)
     * is fully done. The distance from tail to head is therefore how many
     * frames are still "in the ring" - waiting to key up or on the air right
     * now - out of FRAME_MAX_COUNT-1 usable slots. */
    uint8_t head = txFrameHead;
    uint8_t tail = RING_OBSERVE(txFrameTail);
    return (uint8_t)((head + FRAME_MAX_COUNT - tail) % FRAME_MAX_COUNT);
}

bool Ax25TxBufferPending(void) {
    return Ax25TxFramesPending() != 0;
}

bool Ax25ReadNextRxFrame(uint8_t **dst, uint16_t *size, int8_t *peak, int8_t *valley, uint8_t *level, uint8_t *corrected, uint16_t *mV) {
    uint8_t tail = rxFrameTail; /* we own this one */

    /* Acquire: everything the producer wrote before its release store - the
     * handle AND the rxBuffer payload it points at - is visible from here on. */
    if (tail == RING_OBSERVE(rxFrameHead))
        return false;

    const struct FrameHandle *h = &rxFrame[tail];
    uint16_t start = h->start;
    uint16_t len = h->size;

    if (len > AX25_FRAME_MAX_SIZE) /* cannot happen; do not overrun if it does */
        len = AX25_FRAME_MAX_SIZE;

    *dst = outputFrameBuffer;
    for (uint16_t i = 0; i < len; i++)
        (*dst)[i] = rxBuffer[(start + i) % FRAME_BUFFER_SIZE];

    *peak = h->peak;
    *valley = h->valley;
    *level = h->level;
    *size = len;
    *corrected = h->corrected;
    *mV = h->mVrms;

    /* Release the bytes first, then the slot: the producer must never conclude
     * the payload is reusable before we have finished copying it out. */
    RING_PUBLISH(rxBufferTail, (uint16_t)((start + h->size) % FRAME_BUFFER_SIZE));
    RING_PUBLISH(rxFrameTail, RING_NEXT(tail));
    return true;
}

enum Ax25RxStage Ax25GetRxStage(uint8_t modem) {
    return rxState[modem].rx;
}

void Ax25BitParse(uint8_t bit, uint8_t modem, uint16_t mV) {
    if (lastCrc != 0) { /* a frame was received */
        rxMultiplexDelay++;
        if (rxMultiplexDelay > RX_DEDUP_HOLD_CALLS) {
            /* hold it for a while and wait for the other decoders to receive it */
            lastCrc = 0;
            rxMultiplexDelay = 0;
        }
    }

    struct RxState *rx = &rxState[modem];

    rx->rawData <<= 1;
    rx->rawData |= (bit > 0);

#ifdef ENABLE_FX25
    rx->tag >>= 1;
    if (bit)
        rx->tag |= 0x8000000000000000ULL;

    if (Ax25Config.fx25 && (rx->rx != RX_STAGE_FX25_FRAME) && (NULL != (rx->fx25Mode = (struct Fx25Mode *)Fx25GetModeForTag(rx->tag)))) {
        rx->rx = RX_STAGE_FX25_FRAME;
        rx->receivedByte = 0;
        rx->receivedBitIdx = 0;
        rx->frameIdx = 0;
        return;
    }

    if (rx->rx != RX_STAGE_FX25_FRAME) {
#endif

        if (rx->rawData == 0x7E) { /* HDLC flag received */
            if (rx->rx == RX_STAGE_FRAME) {
                /* a correct frame is at least 17 bytes (source+destination+control+CRC) */
                if (rx->frameIdx >= 17) {
                    rx->crc ^= 0xFFFF;
                    if ((rx->frame[rx->frameIdx - 2] == (rx->crc & 0xFF)) && (rx->frame[rx->frameIdx - 1] == ((rx->crc >> 8) & 0xFF))) {
                        uint16_t i = 13; /* start at the SSID of the source */
                        for (; i < (rx->frameIdx - 2); i++) {
                            if (rx->frame[i] & 1) /* path end bit */
                                break;
                        }

                        /* if non-APRS frames are not allowed, require control=0x03 and PID=0xF0 */
                        if (Ax25Config.allowNonAprs || ((rx->frame[i + 1] == 0x03) && (rx->frame[i + 2] == 0xF0))) {
                            rx->frameIdx -= 2; /* remove CRC */
                            if (rx->crc != lastCrc) {
                                /* the other decoder has not received this frame yet */
                                lastCrc = rx->crc;
                                rxMultiplexDelay = 0; /* restart the dedup hold for THIS frame */

                                if (rxRingHasRoom(rx->frameIdx)) {
                                    /*
                                     * Order matters, and it used to be wrong. The old code
                                     * filled the handle, advanced rxFrameHead, and only THEN
                                     * copied the payload into rxBuffer - so the service task
                                     * (a different task, on a different core, with no lock and
                                     * no barrier between them) could see the frame appear and
                                     * copy it out of rxBuffer before, or while, it was written.
                                     * The frame it handed up was a mix of the new frame and
                                     * whatever the ring still held from an earlier one, which
                                     * is how a byte-shifted frame could reach the application
                                     * having legitimately passed the FCS check right here.
                                     *
                                     * Payload first, then the handle, then one release store
                                     * to publish the slot. Nothing before the release can be
                                     * reordered past it, and the consumer's matching acquire
                                     * load guarantees it sees all of it.
                                     */
                                    uint8_t slot = rxFrameHead;
                                    uint16_t start = rxBufferHead;

                                    for (uint16_t j = 0; j < rx->frameIdx; j++) {
                                        rxBuffer[rxBufferHead++] = rx->frame[j];
                                        rxBufferHead %= FRAME_BUFFER_SIZE;
                                    }

                                    rxFrame[slot].start = start;
                                    rxFrame[slot].size = rx->frameIdx;
                                    rxFrame[slot].mVrms = mV;
                                    ModemGetSignalLevel(modem, &rxFrame[slot].peak, &rxFrame[slot].valley, &rxFrame[slot].level);
#ifdef ENABLE_FX25
                                    rxFrame[slot].fx25Mode = NULL;
#endif
                                    rxFrame[slot].corrected = AX25_NOT_FX25;

                                    RING_PUBLISH(rxFrameHead, RING_NEXT(slot));
                                } else {
                                    ESP_LOGW(TAG, "RX frame buffer full, frame dropped");
                                }
                            }
                        }
                    }
                }
            }
            rx->rx = RX_STAGE_FLAG;
            rx->receivedByte = 0;
            rx->receivedBitIdx = 0;
            rx->frameIdx = 0;
            rx->crc = 0xFFFF;
            return;
        } else {
            rx->rx = RX_STAGE_FRAME;
        }

