hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
            txByte >>= 1;
            txBitIdx++;
        }
    } else {
        /* FX.25 mode, or AX.25 preamble/flags: no CRC, no bit stuffing */
        txBit = txByte & 1;
        txByte >>= 1;
        txBitIdx++;
    }
    return txBit;
}

void Ax25TransmitBuffer(void) {
    if (txInitStage == TX_INIT_WAITING)
        return;
    if (txInitStage == TX_INIT_TRANSMITTING)
        return;

    if (RING_OBSERVE(txFrameHead) != txFrameTail) {
        /* In full duplex there is no reason to wait at all. */
        txQuiet = millis() + (Ax25Config.fullDuplex ? 0 : Ax25Config.quietTime);
        txInitStage = TX_INIT_WAITING;
    }
}

/**
 * @brief Log "PTT ON" together with the actual content of the frame that is
 * about to key up, decoded back into a readable TNC2 line
 * ("SRC>DST,PATH:info"), instead of a fixed placeholder string.
 *
 * txFrameTail still points at that frame here: transmitStart() runs before
 * the DAC ISR has clocked out a single bit of it, so txRetireFrame() (which
 * advances txFrameTail) has not run yet. Skipped entirely when INFO logging
 * is off for this tag, same as the TX-queued log, so it costs nothing then.
 */
static void logPttOn(void) {
    if (esp_log_level_get(TAG) < ESP_LOG_INFO) {
        return;
    }

    const struct FrameHandle *h = &txFrame[txFrameTail];

#ifdef ENABLE_FX25
    if (NULL != h->fx25Mode) {
        /* FX.25-encoded bytes (Reed-Solomon block) are not a plain AX.25
         * frame, so there is nothing meaningful for ax25_decode() to read. */
        ESP_LOGI(TAG, "PTT ON (keyed up)");
        return;
    }
#endif

    uint16_t len = h->size;
    if (len > AX25_FRAME_MAX_SIZE) /* cannot happen; do not overrun if it does */
        len = AX25_FRAME_MAX_SIZE;

    for (uint16_t i = 0; i < len; i++)
        txLogBuffer[i] = txBuffer[(h->start + i) % FRAME_BUFFER_SIZE];

    ax25_msg_t decoded;
    if (ax25_decode(txLogBuffer, len, 0, &decoded)) {
        char tnc2[256];
        modem_format_tnc2(&decoded, tnc2, sizeof(tnc2));
        ESP_LOGI(TAG, "PTT ON (keyed up) - %s", tnc2);
    } else {
        ESP_LOGI(TAG, "PTT ON (keyed up)");
    }
}

/**
 * @brief Start transmission immediately.
 * @warning Transmission must be initialized via Ax25TransmitBuffer().
 */
static void transmitStart(void) {
    txCrc = 0xFFFF;
    txStage = TX_STAGE_PREAMBLE;
    txByte = 0;
    txBitIdx = 0;
    txFlagsElapsed = 0;
    txDelayElapsed = 0;
    ModemTransmitStart();
    logPttOn();
}

/**
 * @brief Poll for TX events raised by the DAC ISR and log them.
 *
 * The ISR (Ax25GetTxBit(), via txRetireFrame() and the TX_STAGE_TAIL
 * completion) only sets plain flags/counters - it must not call ESP_LOGx
 * itself, since that runs far too much code (and can block) to be safe at
 * DAC-sample-clock priority. This runs once per Ax25TransmitCheck() call,
 * which happens every service-task tick in ordinary task context, so it is
 * safe to log from here instead.
 */
static void pollTxEvents(void) {
    static uint32_t lastReportedSentCount = 0;
    uint32_t sent = txFramesSentCount; /* single writer (ISR); safe plain read here */
    while (lastReportedSentCount != sent) {
        lastReportedSentCount++;
        ESP_LOGI(TAG, "Packet sent (frame #%u)", (unsigned)lastReportedSentCount);
    }

    if (txJustKeyedDown) {
        txJustKeyedDown = false;
        ESP_LOGI(TAG, "PTT OFF (key down)");
    }
}

void Ax25TransmitCheck(void) {
    pollTxEvents();

    if (txInitStage == TX_INIT_OFF) /* nothing to transmit */
        return;
    if (txInitStage == TX_INIT_TRANSMITTING) /* already transmitting */
        return;

    if (txQuiet > millis()) /* quiet time has not elapsed yet */
        return;

    /* Full duplex: the channel state is irrelevant, key up right away.
     * This is also what makes the GPIO ADC -> GPIO DAC loop work: the DCD is
     * permanently asserted by our own carrier, so a CSMA node would never
     * transmit a second frame. */
    if (Ax25Config.fullDuplex || !ModemDcdState()) {
        txInitStage = TX_INIT_TRANSMITTING;
        txRetries = 0;
        transmitStart();
    } else { /* channel is busy */
        if (txRetries >= MAX_TRANSMIT_RETRY_COUNT) {
            ESP_LOGI(TAG, "Channel busy after %u retries, transmitting anyway", txRetries);
            txInitStage = TX_INIT_TRANSMITTING;
            txRetries = 0;
            transmitStart();
        } else {
            txQuiet = millis() + randomRange(100, 1000);
            txRetries++;
        }
    }
}

void Ax25Init(uint8_t fx25Mode) {
    txCrc = 0xFFFF;
    uint8_t fullDuplex = Ax25Config.fullDuplex; /* preserve across re-init */
    memset(&Ax25Config, 0, sizeof(Ax25Config));
    Ax25Config.fullDuplex = fullDuplex;
    Ax25Config.quietTime = 2000;
    Ax25Config.txDelayLength = 300;
    Ax25Config.txTailLength = 1;

    if (fx25Mode == 0) {
        Ax25Config.fx25 = 0;
        Ax25Config.fx25Tx = 0;
    } else if (fx25Mode == 1) {
        Ax25Config.fx25 = 1;
        Ax25Config.fx25Tx = 0;
    } else {
        Ax25Config.fx25 = 1;
        Ax25Config.fx25Tx = 1;
    }

    memset(rxState, 0, sizeof(rxState));
    for (uint8_t i = 0; i < countof(rxState); i++)
        rxState[i].crc = 0xFFFF;

    rxBufferHead = 0;
    rxBufferTail = 0;
    rxFrameHead = 0;
    rxFrameTail = 0;
    rxMultiplexDelay = 0;
    txBufferHead = 0;
    txBufferTail = 0;
    txFrameHead = 0;
    txFrameTail = 0;
    txBitIdx = 8; /* force a stage evaluation on the very first Ax25GetTxBit() */
    txStage = TX_STAGE_IDLE;
    lastCrc = 0;

    /* milliseconds -> byte count */
    txDelay = (uint16_t)((float)Ax25Config.txDelayLength / (8.f * 1000.f / ModemGetBaudrate()));
    txTail = (uint16_t)((float)Ax25Config.txTailLength / (8.f * 1000.f / ModemGetBaudrate()));
    txInitStage = TX_INIT_OFF;
    txQuiet = millis() + Ax25Config.quietTime + randomRange(10, 200);
}

void Ax25TxDelay(uint16_t delay_ms) {
    Ax25Config.txDelayLength = delay_ms;
    txDelay = (uint16_t)((float)Ax25Config.txDelayLength / (8.f * 1000.f / ModemGetBaudrate()));
}

void Ax25TimeSlot(uint16_t ts) {
    if (ts > 0) {
        Ax25Config.quietTime = ts;
        txQuiet = millis() + Ax25Config.quietTime + randomRange(100, 1000);
    } else {
        txQuiet = 0;
    }
}

