hiperiondev/esp32idf_APRS/components/esp32idf_radioamateur_modem/src/ax25.c
/* ====================================================================== */
/*  TNC2 <-> AX.25 helpers                                                */
/* ====================================================================== */

static unsigned int strpos(const char *txt, char chk) {
    const char *pch = strchr(txt, chk);
    if (pch == NULL)
        return 0;
    return (unsigned int)(pch - txt);
}

static void convPath(ax25_header_t *hdr, const char *txt, unsigned int size) {
    unsigned int i, p, j;
    char num[5];

    hdr->ssid = 0;
    memset(hdr->addr, 0, sizeof(hdr->addr));
    memset(num, 0, sizeof(num));

    p = strpos(txt, '-');
    if (p > 0 && p < size) {
        for (i = 0; i < p && i < 6; i++) /* callsign/path */
            hdr->addr[i] = txt[i];

        j = 0;
        for (i = p + 1; i < size && j < sizeof(num) - 1; i++) { /* SSID */
            if (txt[i] < 0x30)
                break;
            if (txt[i] > 0x39)
                break;
            num[j++] = txt[i];
        }
        if (j > 0)
            hdr->ssid = (char)atoi(num);

        hdr->ssid <<= 1;
    } else {
        for (i = 0; i < size && i < 6; i++) {
            if (txt[i] == '*')
                break;
            if (txt[i] == ',')
                break;
            if (txt[i] == ':')
                break;
            hdr->addr[i] = txt[i];
        }
        hdr->ssid = 0;
    }
    p = strpos(txt, '*');
    if (p > 0 && p < size)
        hdr->ssid |= 0x80;
    hdr->ssid |= 0x60;
}

char ax25_encode(ax25_frame_t *frame, char *txt, int size) {
    char *token, *ptr;
    int i;
    unsigned int p, p2, p3;
    char j;

    memset(frame, 0, sizeof(ax25_frame_t));

    p = strpos(txt, ':');
    if (p > 0 && p < (unsigned int)size) {
        /* payload */
        memset(frame->data, 0, sizeof(frame->data));
        for (i = 0; i < (size - (int)p) - 1 && i < (int)sizeof(frame->data) - 1; i++)
            frame->data[i] = txt[p + i + 1];

        p2 = strpos(txt, '>');
        if (p2 > 0 && p2 < (unsigned int)size) {
            convPath(&frame->header[1], &txt[0], p2); /* source callsign */
            j = (char)strpos(txt, ',');
            if ((j < 1) || ((unsigned int)j > p))
                j = (char)p;
            convPath(&frame->header[0], &txt[p2 + 1], (unsigned int)j - p2 - 1); /* destination */

            p3 = 0;
            if (((unsigned int)j > p2) && ((unsigned int)j < p)) { /* digipeater path present */
                for (i = j; i < size; i++) {
                    if (txt[i] == ':') {
                        for (; i < size; i++)
                            txt[p3++] = 0x00;
                        break;
                    }
                    txt[p3++] = txt[i];
                }
                token = strtok(txt, ",");
                j = 0;
                while (token != NULL) {
                    ptr = token;
                    convPath(&frame->header[j + 2], ptr, (unsigned int)strlen(ptr));
                    token = strtok(NULL, ",");
                    j++;
                    if (j > 7)
                        break;
                }
            }

            for (i = 0; i < 10; i++)
                frame->header[i].ssid &= 0xFE; /* clear all end-of-path bits */
            /* fix the end-of-path bit */
            for (i = 2; i < 10; i++) {
                if (frame->header[i].addr[0] == 0x00) {
                    frame->header[i - 1].ssid |= 0x01;
                    break;
                }
            }
            return 1;
        }
    }
    return 0;
}

static void ax25_putRaw(uint8_t *raw, ax25_ctx_t *ctx, uint8_t c) {
    /* No byte-level escaping here. The real HDLC bit-stuffing (insert a 0 bit
     * after five consecutive 1 bits) is done later, per bit, in Ax25GetTxBit().
     * Escaping bytes here as well used to inject a spurious 0x1B whenever a
     * header byte equalled 0x7E/0x7F/0x1B (e.g. SSID 15 encodes to 0x7E),
     * corrupting the transmitted frame. */
    ctx->crc_out = update_crc_ccit(c, ctx->crc_out);
    *raw = c;
}

int hdlcFrame(uint8_t *outbuf, size_t outbuf_len, ax25_ctx_t *ctx, ax25_frame_t *pkg) {
    int i, j;
    int idx = 0;
    uint8_t data = 0;
    uint8_t info[AX25_FRAME_MAX_SIZE];

    ctx->crc_out = CRC_CCIT_INIT_VAL;

    for (i = 0; i < 10; i++)
        pkg->header[i].ssid &= 0xFE; /* clear all end-of-path bits */
    for (i = 1; i < 10; i++) {
        if (pkg->header[i].addr[0] == 0x00) {
            pkg->header[i - 1].ssid |= 0x01;
            break;
        }
    }

    for (i = 0; i < 10; i++) {
        if (pkg->header[i].addr[0] == 0)
            break;
        for (j = 0; j < 6; j++) {
            data = (uint8_t)pkg->header[i].addr[j];
            if (data == 0)
                data = 0x20;
            data <<= 1;
            if (idx >= (int)sizeof(info))
                return 0;
            ax25_putRaw(&info[idx++], ctx, data);
        }
        if (idx >= (int)sizeof(info))
            return 0;
        ax25_putRaw(&info[idx++], ctx, (uint8_t)pkg->header[i].ssid);
        if (pkg->header[i].ssid & 0x01)
            break;
    }

    ax25_putRaw(&info[idx++], ctx, AX25_CTRL_UI);      /* 0x03 - APRS UI frame */
    ax25_putRaw(&info[idx++], ctx, AX25_PID_NOLAYER3); /* 0xF0 - no layer 3 */

    for (i = 0; i < (int)strlen(pkg->data); i++) {
        if (idx >= (int)sizeof(info))
            break;
        ax25_putRaw(&info[idx++], ctx, (uint8_t)pkg->data[i]);
    }

    if ((size_t)idx > outbuf_len)
        return 0;

    memcpy(outbuf, info, (size_t)idx);
    return idx;
}
